Ran Plan for dir: `infra-live/nonprod/us-west-2/dev/s3-test-bucket` workspace: `default`

<details><summary>Show Output</summary>

```diff
Cloning into 'asdf'...
Note: switching to '0adc6c11fb4f87dbb476f8b61e4cf8fb7613599b'.

You are in 'detached HEAD' state. You can look around, make experimental
changes and commit them, and you can discard any commits you make in this
state without impacting any branches by switching back to a branch.

If you want to create a new branch to retain commits you create, you may
do so (now or later) by using -c with the switch command. Example:

  git switch -c <new-branch-name>

Or undo this operation with:

  git switch -

Turn off this advice by setting config variable advice.detachedHead to false

Checking for asdf jq plugin
Checking jq version matches 1.6
Checking for asdf terraform plugin
Checking terraform version matches 1.3.7
Checking for asdf terragrunt plugin
Checking terragrunt version matches 0.49.1
Checking for asdf tflint plugin
Checking tflint version matches 0.46.0
infracost       0.10.29         /home/atlantis/tools/.tool-versions
jq              1.6             /home/atlantis/tools/.tool-versions
kustomize       ______          No version is set. Run "asdf <global|shell|local> kustomize <version>"
terraform       1.3.7           /home/atlantis/tools/.tool-versions
terragrunt      0.49.1          /home/atlantis/tools/.tool-versions
tflint          0.46.0          /home/atlantis/tools/.tool-versions
Now run . /home/atlantis/tools/asdf/asdf.sh


Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/aws versions matching ">= 4.9.0, < 5.0.0"...
- Installing hashicorp/aws v4.67.0...
- Installed hashicorp/aws v4.67.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

╷
│ Warning: Version constraints inside provider configuration blocks are deprecated
│ 
│   on provider.tf line 3, in provider "aws":
│    3:   version = ">= 4.9.0, < 5.0.0"
│ 
│ Terraform 0.13 and earlier allowed provider version constraints inside the
│ provider configuration block, but that is now deprecated and will be
│ removed in a future version of Terraform. To silence this warning, move the
│ provider version constraint into the required_providers block.
╵

Terraform has been successfully initialized!
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.example will be created
  + resource "aws_s3_bucket" "example" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "my-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
        }
      + tags_all                    = {
          + "Environment" = "dev"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + name = "my-bucket"

Warning: Version constraints inside provider configuration blocks are deprecated

  on provider.tf line 3, in provider "aws":
   3:   version = ">= 4.9.0, < 5.0.0"

Terraform 0.13 and earlier allowed provider version constraints inside the
provider configuration block, but that is now deprecated and will be removed
in a future version of Terraform. To silence this warning, move the provider
version constraint into the required_providers block.
Releasing state lock. This may take a few moments...

time="2023-10-09T18:26:41Z" level=info msg="Detected Terraform plan JSON file at /home/atlantis/.atlantis/repos/gpt-next/nonprod-deploy-repo/6/default/infra-live/nonprod/us-west-2/dev/s3-test-bucket/default.json"
time="2023-10-09T18:26:41Z" level=info msg="Starting: Extracting only cost-related params from terraform"
time="2023-10-09T18:26:41Z" level=info msg="Starting: Retrieving cloud prices to calculate costs"
time="2023-10-09T18:26:42Z" level=info msg="Output saved to /home/atlantis/tmp/gpt-next-nonprod-deploy-repo-6/default-infra-live-nonprod-us-west-2-dev-s3-test-bucket-infracost.json"
Output saved to /home/atlantis/tmp/gpt-next-nonprod-deploy-repo-6/infracost-comment.md
Project: infra-live/nonprod/us-west-2/dev/s3-test-bucket

 Name                                             Monthly Qty  Unit                    Monthly Cost 
                                                                                                    
 aws_s3_bucket.example                                                                              
 └─ Standard                                                                                        
    ├─ Storage                              Monthly cost depends on usage: $0.023 per GB            
    ├─ PUT, COPY, POST, LIST requests       Monthly cost depends on usage: $0.005 per 1k requests   
    ├─ GET, SELECT, and all other requests  Monthly cost depends on usage: $0.0004 per 1k requests  
    ├─ Select data scanned                  Monthly cost depends on usage: $0.002 per GB            
    └─ Select data returned                 Monthly cost depends on usage: $0.0007 per GB           
                                                                                                    
 OVERALL TOTAL                                                                                $0.00 
──────────────────────────────────
1 cloud resource was detected:
∙ 1 was estimated, it includes usage-based costs, see https://infracost.io/usage-file

┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━┓
┃ Project                                            ┃ Monthly cost ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━┫
┃ infra-live/nonprod/us-west-2/dev/s3-test-bucket    ┃ $0.00        ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━┛
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra-live/nonprod/us-west-2/dev/s3-test-bucket`
* :put_litter_in_its_place: To **delete** this plan click [here](https://sloth-beloved-wren.ngrok-free.app/lock?id=gpt-next%252Fnonprod-deploy-repo%252Finfra-live%252Fnonprod%252Fus-west-2%252Fdev%252Fs3-test-bucket%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra-live/nonprod/us-west-2/dev/s3-test-bucket`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`